# Задача_001

# Предложите пользователю ввести его имя и выведите приветственное сообщение:
# Hello, [имя].

name = input('Введите имя: ')
print(f'Hello {name}')

# Ещё вариант решения
print('Hello', input('Введите имя: '))