# Задача_010

# В одном килограмме 2,204 фунта. Предложите пользователю ввести вес в килограммах и переведите его в фунты.

print(f'Вес в фунтах будет равен: {int(input("Введите вес в килограммах: ")) * 2.204}')