# Задача_031

# Предложите пользователю ввести радиус круга (расстояние от центра до внешней границы.) 
# Вычислите площадь круга (π * радиус2).
import math

r = int(input('Введите радиус круга: '))
print(math.pi * (r**2))