# Задача_030

# Выведите число «пи» (π) с точностью до 5 знаков.

import math

print(round(math.pi, 5))