# Задача_027

# Предложите пользователю ввести число с большим количеством знаков в дробной части. 
# Умножьте это число на 2 и выведите ответ. 
numb = float(input('Введите число с большим количеством знаков в дробной части: '))
print(numb*2)
