# Задача_020

# Предложите пользователю ввести имя. Выведите длину имени.

name = input('Введите ваше имя? ')
print(len(name))