# Задача_024

# Предложите пользователю ввести имя. 
# Выведите его в верхнем регистре.

print(input('Введите Ваше имя: ').upper())

# Другой вариант

your_name = input('Введите имя: ')
your_name = your_name.upper()
print(your_name)