# Задача_037

# Предложите пользователю ввести имя. 
# Выведите каждую букву имени в отдельной строке.

name = input('Введите имя: ')
for i in name:
    print(i)
    