# Задача_035

# Предложите пользователю ввести имя. Выведите имя три раза.

name = input('Введите имя')

for i in range(3):
    print(name)