# Задача_107

# Откройте файл Names.txt и выведите данные из кода Python.

file = open('Names.txt', 'r')
print(file.read())
file.close()