# Задача_084

# Предложите пользователю ввести его почтовый индекс. 
# Выведите первые две буквы слова в верхнем регистре(1).

# (В англоязычных странах почтовые индексы зачастую начинаются с латинских букв; 
# вы можете найти любой индекс этого типа для выполнения данной задачи. — Примеч. ред.)

post_code = 'bn20 7TE'
print(post_code[:2].upper() + post_code[2:])